from TCH.Const import wc, mks

g = 0.01 * wc  # g/(h * wc) = 0.01 << 1 (RWA)

time_limit = 1 * mks  # время эволюции: 1 мкс

dt = 0.25 * ns  # шаг по времени: 0.25 нс

la_0 = g * 1.0  # интенсивность утечки фотонов
lA_0 = g * 1.0  # интенсивность атомного превращения

# коэффициент усиления интенсивности утечки фотонов
l_a_range = [
    1.0, 1.5, 2.0, 2.5, 3.0, 3.5, 4.0, 4.5, 5.0,
    5.5, 6.0, 6.5, 7.0, 7.5, 8.0, 8.5, 9.0, 9.5, 10.0
]

ro_err = 0.01  # допустимая погрешность нормы матрицы плотности
